--------------------------------------------------------------------------------
-- TMXMapのObjectGroupです.
--
-- @class table
-- @name TMXObject
--------------------------------------------------------------------------------
local M = {}

---------------------------------------
-- コンストラクタです
---------------------------------------
function M:new()
    local obj = {
        name = "",
        type = "",
        x = 0,
        y = 0,
        width = 0,
        height = 0,
        gid = nil,
        properties = {},
    }
    return obj
end

return M
